import { useState } from "react";
import img1 from "../../img/סט חתן אלקנט מט.jpg";
import img2 from "../../img/סט גביע צלחת ליבורנו קל.jpg";
import img3 from "../../img/סט גביע וצלחת קוביות בטן.jpg";
import img4 from "../../img/סט חזון איש פילגרין על רגל.jpg";
import img5 from "../../img/סט חתן קורדליה.jpg";
import img6 from "../../img/סט גביע וצלחת פילגרין בטן עם רגל.jpg";
import img7 from "../../img/סט חתן בלג'ו מקושט קל.jpg";
import img8 from "../../img/סט בר המרינג.jpg";
import img9 from "../../img/סט חתן קרלוס מוזהב.jpg";
import img10 from "../../img/סט צלחת וגביע על רגל אגמים.jpg";
export default function Products(){
    const [product, setProducts] = useState([
        {
            id:1,
            product_name: "סט חתן אלקנט מט",
            product_price: 3890,
            height:10.00,
            diameter:23.5,
            volume:200.00,
            unitsInStock:20,
            brand:"HAZORFIM",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img1,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 25326-0500"
        },
        {
            id:2,
            product_name: "סט גביע צלחת ליבורנו קל",
            product_price: 990,
            height:9.00,
            diameter:190.00,
            unitsInStock:9,
            brand:"HAZORFIM",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img2,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 25265-0125"
        },
        {
            id:3,
            product_name: "סט גביע וצלחת קוביות בטן",
            product_price: 1291,
            height:9.00,
            diameter:14.00,
            volume:200.00,
            unitsInStock:5,
            brand:"HAZORFIM",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img3,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 25301-0175"
        },
        {
            id:4,
            product_name: "סט חזון איש פילגרין על רגל",
            product_price: 1291,
            height:13.50,
            diameter:14.00,
            volume:180.00,
            unitsInStock:20,
            brand:"HAZORFIM",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img4,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 20083-0165"
        },
        {
            id:5,
            product_name: "סט חתן קורדליה",
            product_price: 1525,
            height:9.20,
            diameter:16.00,
            volume:200.00,
            unitsInStock:17,
            brand:"HAZORFIM",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img5,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 24305-0223"
        },
        {
            id:6,
            product_name: "סט גביע וצלחת פילגרין בטן עם רגל",
            product_price: 1460,
            height:15.50,
            diameter:14.00,
            volume:220.00,
            unitsInStock:2,
            brand:"HAZORFIM",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img6,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 20083-0200"
        },
        {
            id:7,
            product_name: "סט חתן בלג'ו מקושט קל",
            product_price: 2080,
            height:9.50,
            diameter:15.50,
            volume:220.00,
            unitsInStock:3,
            brand:"HAZORFIM",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img7,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 25257-0240"
        },
        {
            id:8,
            product_name: "סט בר המרינג",
            product_price: 1517,
            height:7.50,
            diameter:12.00,
            volume:110.00,
            unitsInStock:30,
            brand:"HAZORFIM_LEGACY",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img8,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 24305-0223"
        },
        {
            id:9,
            product_name: "סט חתן קרלוס מוזהב",
            product_price: 7421,
            height:10.50,
            diameter:22.00,
            volume:150.00,
            unitsInStock:2,
            brand:"HAZORFIM_LEGACY",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img9,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 24305-0223"
        },
        {
            id:10,
            product_name: "סט צלחת וגביע על רגל אגמים",
            product_price: 10697,
            height:15.70,
            diameter:17.50,
            unitsInStock:22,
            brand:"HAZORFIM GALLERY Y.M",
            material:" כסף סטרלינג 925 מצופה זהב",
            img:img10,
            discription:"כששולחן השבת ערוך ומוכן, בוהק לאור הנרות סט גביע וצלחת מבית הצורפים. כענבי הגפן, כך גביעי הכסף הטהור עם צלחת הכסף המעוצבת משתלבים באופן מושלם. אמני הצורפים לקחו השראה ממגוון סגנונות ותרבויות ויצרו שידוכים מופלאים. העיטורים והחריטות העוטפים את הגביעים והצלחות נוצרו בעבודת יד מיומנת של אמן. כל גביע וכל צלחת נעשים במיומנות גבוהה ובהקפדה רבה. אתם מוזמנים לבחור את השידוך המושלם עבורכם ולהאיר את שולחן השבת בסט גביע וצלחת של הצורפים. 25315-0540"
        }
    ])
}